#!/bin/bash

if [ $# -ne 4 ]; then 
    echo "Указано неправильно количество параметров"
    exit 1
fi

for i in {1..4}; do
    param="${!i}"
    if ! [[ $param =~ ^[1-6]$ ]]; then
        echo " Неправильный формат данных, введите числа от 1 до 6"
        exit 1
    elif [[ $1 -eq $2 || $3 -eq $4 ]]; then
        echo "Цвет фона и шрифта у одного и того же столбца не должны совпадать"
        echo "Вызовете повторно скрипт и испраьте параметры"
        exit 1
    fi 
done
    chmod +x script03.sh
    ./script03.sh "$1" "$2" "$3" "$4"